#### Terraform Path: `infra/ecs`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ory-dev/ecs/runs/run-novqriyfzdmZze9p

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
data.aws_ssm_parameter.cidr_allow_list[0]: Refreshing...
data.aws_ssm_parameter.network_info: Refreshing...
module.autoscaling.data.aws_partition.current: Refreshing...
data.aws_ssm_parameter.ecs_ami: Refreshing...
module.autoscaling.data.aws_default_tags.current: Refreshing...
data.aws_caller_identity.current: Refreshing...
module.autoscaling.data.aws_default_tags.current: Refresh complete after 0s [id=aws]
module.autoscaling.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.autoscaling.data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.autoscaling.data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=1256122602]
data.aws_caller_identity.current: Refresh complete after 0s [id=182402351974]
data.aws_iam_policy_document.read_ssm_secretsmanager: Refreshing...
data.aws_iam_policy_document.read_ssm_secretsmanager: Refresh complete after 0s [id=659006675]
data.aws_ssm_parameter.ecs_ami: Refresh complete after 0s [id=/aws/service/ecs/optimized-ami/amazon-linux-2/arm64/recommended]
data.aws_ssm_parameter.cidr_allow_list[0]: Refresh complete after 0s [id=/ory-dev/ory/dev/network/allow-list]
data.aws_ssm_parameter.network_info: Refresh complete after 0s [id=/ory-dev/ory/dev/network/info]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/ory-dev-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }
    }

  # aws_iam_policy.read_ssm_secretsmanager will be created
  + resource "aws_iam_policy" "read_ssm_secretsmanager" {
      + arn         = (known after apply)
      + description = "Allows read access to the Secrets Manager"
      + id          = (known after apply)
      + name        = "ory-dev-read-ssm-secretsmanager"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:182402351974:parameter/ory-dev/ory/dev/*",
                          + "arn:aws:secretsmanager:us-east-1:182402351974:secret:/ory-dev/ory/dev/*",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }
    }

  # aws_ssm_parameter.cluster_info will be created
  + resource "aws_ssm_parameter" "cluster_info" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECS cluster info"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ory-dev/ory/dev/cluster/info"
      + overwrite      = true
      + tags_all       = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.autoscaling.aws_autoscaling_group.idc[0] will be created
  + resource "aws_autoscaling_group" "idc" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "ory-dev-asg-"
      + protect_from_scale_in     = true
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = []
      + vpc_zone_identifier       = (sensitive value)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "dev"
        }
      + tag {
          + key                 = "ManagedBy"
          + propagate_at_launch = true
          + value               = "Terraform Cloud"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ory-dev-asg"
        }
      + tag {
          + key                 = "Organization"
          + propagate_at_launch = true
          + value               = "ory-dev"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "ory"
        }
      + tag {
          + key                 = "Repository"
          + propagate_at_launch = true
          + value               = "keenan-v1/ory-example"
        }
      + tag {
          + key                 = "Workspace"
          + propagate_at_launch = true
          + value               = "ecs"
        }

      + timeouts {}
    }

  # module.autoscaling.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ory-dev-"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }
      + unique_id   = (known after apply)
    }

  # module.autoscaling.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS role for ory-dev-asg"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ory-dev-"
      + path                  = "/"
      + tags_all              = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.autoscaling.aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.autoscaling.aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.autoscaling.aws_iam_role_policy_attachment.this["ReadSSMSecretsManager"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.autoscaling.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = (sensitive value)
      + instance_type          = "t4g.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ory-dev-asg-"
      + tags_all               = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }
      + user_data              = "IyEvYmluL2Jhc2gKY2F0IDw8J0VPRicgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwpFQ1NfQ0xVU1RFUj1vcnktZGV2LWNsdXN0ZXIKRUNTX0xPR0xFVkVMPWRlYnVnCkVPRgo="
      + vpc_security_group_ids = (known after apply)

      + monitoring {
          + enabled = true
        }
    }

  # module.autoscaling_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Autoscaling group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ory-dev-asg-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ory-dev-asg-sg"
        }
      + tags_all               = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Name"         = "ory-dev-asg-sg"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }
      + vpc_id                 = (sensitive value)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.autoscaling_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ cidr_blocks              = (sensitive value)
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.autoscaling_sg.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ cidr_blocks              = (sensitive value)
      + description              = "All IPV4 ICMP"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # module.ecs.aws_ecs_capacity_provider.this["one"] will be created
  + resource "aws_ecs_capacity_provider" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "one"
      + tags_all = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 5
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 60
            }
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "ory-dev-cluster"
      + tags_all           = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "ecs"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_log_group_name = "/aws/ecs/ory-dev-cluster"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "one",
        ]
      + cluster_name       = "ory-dev-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "one"
          + weight            = 100
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + autoscaling_security_group_id = (known after apply)
  + cluster_arn                   = (known after apply)
  + cluster_id                    = (known after apply)
  + cluster_name                  = "ory-dev-cluster"

```

</details>

*Pushed by: @keenan-v1, Action: `pull_request`*